Revit 2026 API

# IFCLegacyStairOrRamp Class

---

The class contains the components of a legacy stair or ramp.

SystemObject Autodesk.Revit.DB.IFCIFCLegacyStairOrRamp

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCLegacyStairOrRamp : IDisposable
```
```vb
Public Class IFCLegacyStairOrRamp
	Implements IDisposable
```
```cpp
public ref class IFCLegacyStairOrRamp : IDisposable
```
```fsharp
type IFCLegacyStairOrRamp =
    class
        interface IDisposable
    end
```

The IFCLegacyStairOrRamp type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsRamp | True if it is a ramp, false if it is a stair. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | RiserHeight | The height of riser. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the IFCLegacyStairOrRamp |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBoundaryLines | Gets boundary lines. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLandingGeometries | Gets the geometries of landings. |
|  | GetNumberOfRisers | Gets the number of risers. |
|  | GetNumberOfTreads | Gets the number of treads. |
|  | GetRunGeometries | Gets the geometries of runs. |
|  | GetStringerGeometries | Gets the geometries of stringers. |
|  | GetTreadsLength | Gets the length of treads. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetWalkLines | Gets walk lines. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.IFC Namespace